## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_identitystore_group.forms_production_admin will be created
  + resource "aws_identitystore_group" "forms_production_admin" {
      + description       = "Grants members administrator access to the GC Forms Production account."
      + display_name      = "Forms-Production-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.forms_production_read_only will be created
  + resource "aws_identitystore_group" "forms_production_read_only" {
      + description       = "Grants members read-only access to the GC Forms Production account."
      + display_name      = "Forms-Production-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.forms_staging_admin will be created
  + resource "aws_identitystore_group" "forms_staging_admin" {
      + description       = "Grants members administrator access to the GC Forms Staging account."
      + display_name      = "Forms-Staging-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.forms_staging_read_only will be created
  + resource "aws_identitystore_group" "forms_staging_read_only" {
      + description       = "Grants members read-only access to the GC Forms Staging account."
      + display_name      = "Forms-Staging-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_ssoadmin_account_assignment.forms_production["Forms-Production-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "957818836222"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.forms_production["Forms-Production-ReadOnly"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "957818836222"
      + target_type        = "AWS_ACCOUNT"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Error: Duplicate object key

  on platform_forms_assignments.tf line 47, in resource "aws_ssoadmin_account_assignment" "forms_staging":
  47:   for_each = { for perm in local.forms_staging_permission_set_arns : perm.group.display_name => perm }
    ├────────────────
    │ perm.group.display_name is "Forms-Staging-ReadOnly"

Two different items produced the key "Forms-Staging-ReadOnly" in this 'for'
expression. If duplicates are expected, use the ellipsis (...) after the
value expression to enable grouping by key.
time=2024-05-11T15:07:19Z level=error msg=terraform invocation failed in /home/runner/work/cds-aws-lz/cds-aws-lz/terragrunt/org_account/iam_identity_center
time=2024-05-11T15:07:19Z level=error msg=1 error occurred:
	* [/home/runner/work/cds-aws-lz/cds-aws-lz/terragrunt/org_account/iam_identity_center] exit status 1



```

</details>

